// //homework 4.3

// // дату народження
// let yearOfBirth = prompt("Введіть рік вашого народження:");
// if (yearOfBirth === null) {
//   alert("Шкода, що Ви не захотіли ввести свій рік народження.");
// } else {
//   let age = new Date().getFullYear() - yearOfBirth;

//   //місто проживання
//   let city = prompt("В якому місті Ви живете?");
//   if (city === null) {
//     alert("Шкода, що Ви не захотіли ввести своє місто проживання.");
//   } else {
//     let capitals = {
//       вашингтон: "США",
//       лондон: "Великої Британії",
//       берлін: "Німеччини",
//       париж: "Франції",
//       токіо: "Японії",
//       пекін: "Китаю",
//       будапешт: "Угорщини",
//       варшава: "Польщі",
//       рим: "Італії",
//       мадрид: "Іспанії",
//       бухарест: "Румунії",
//       відень: "Австрії",
//       канберра: "Австралії",
//       оттава: "Канади",
//       мехіко: "Мексики",
//     };

//     let cityMessage;
//     let cityLower = city.toLowerCase();
//     if (capitals[cityLower]) {
//       cityMessage = `Ти живеш у столиці ${capitals[cityLower]}.`;
//     } else {
//       cityMessage = `Ти живеш у місті ${city}.`;
//     }

//     //улюблений вид спорту
//     let sport = prompt("Який ваш улюблений вид спорту?");
//     if (sport === null) {
//       alert("Шкода, що Ви не захотіли ввести свій улюблений вид спорту.");
//     } else {
//       let sportMessages = {
//         футбол: "Круто! Хочеш стати Ліонелем Мессі?",
//         теніс: "Круто! Хочеш стати Еліна Світоліна?",
//         баскетбол: "Круто! Хочеш стати Майклом Джорданом?",
//         бокс: "Круто! Хочеш стати Александр Усик?",
//       };
//       let sportMessage =
//         sportMessages[sport.toLowerCase()] ||
//         `Ваш улюблений вид спорту: ${sport}.`;

//       alert(`Ваш вік: ${age}\n${cityMessage}\n${sportMessage}`);
//     }
//   }
// }
